STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA65I-DK1/stm32wba65i_discovery_audio.c
  /* Configure SAI1_Block_X Slot */
  hsai->SlotInit.FirstBitOffset     = 0;
  if (MXInit->DataSize == SAI_DATASIZE_24)
  {
    hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_32B;
  }
  else
  {
    hsai->SlotInit.SlotSize         = SAI_SLOTSIZE_16B;
  }
  hsai->SlotInit.SlotNumber         = 2;
  hsai->SlotInit.SlotActive         = MXInit->SlotActive;

  if (HAL_SAI_Init(hsai) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  return status;
}
/**
  * @}
  */

/** @defgroup STM32WBA65I_DK1_AUDIO_OUT_Private_Functions AUDIO OUT Private Functions
  * @{
  */
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Tx Transfer completed callbacks.
  * @param  hsai SAI handle
  * @retval None
  */
static void SAI_TxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  /* Manage the remaining file size and new address offset: This function
     should be coded by user (its prototype is already declared in stm32wba65i_discovery_audio.h) */
  BSP_AUDIO_OUT_TransferComplete_CallBack(0);
}

/**
  * @brief  Tx Half Transfer completed callbacks.
  * @param  hsai  SAI handle
  * @retval None
  */
static void SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  /* Manage the remaining file size and new address offset: This function
     should be coded by user (its prototype is already declared in stm32wba65i_discovery_audio.h) */
  BSP_AUDIO_OUT_HalfTransfer_CallBack(0);
}

/**
  * @brief  SAI error callbacks.
  * @param  hsai  SAI handle
  * @retval None
  */
static void SAI_ErrorCallback(SAI_HandleTypeDef *hsai)
{
  if (hsai->Instance == AUDIO_OUT_SAI)
  {
    BSP_AUDIO_OUT_Error_CallBack(0);
  }
  else
  {
    BSP_AUDIO_IN_Error_CallBack(0);
  }
}
#endif /* SAI Register callbacks */
/**
  * @}
  */

/** @addtogroup STM32WBA65I_DK1_AUDIO_IN_Exported_Functions
  * @{
  */

/**
  * @brief  Initialize wave recording.
  * @param  Instance  Audio IN instance: 0 for SAI
  * @param  AudioInit Init structure
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RESET)
  {
    ret = BSP_ERROR_BUSY;
  }
  else if (AudioInit->BitsPerSample != AUDIO_RESOLUTION_16B)
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((AudioInit->ChannelsNbr != 1U) && (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_MIC))
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((AudioInit->ChannelsNbr != 2U) && (AudioInit->Device == AUDIO_IN_DEVICE_LINE_IN))
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((AudioInit->ChannelsNbr != 1U) && (AudioInit->Device == AUDIO_IN_DEVICE_DIGITAL_MIC))
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[0].SampleRate != AudioInit->SampleRate))
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else
  {
    /* Store the audio record context */
    Audio_In_Ctx[Instance].Device          = AudioInit->Device;
    Audio_In_Ctx[Instance].ChannelsNbr     = AudioInit->ChannelsNbr;
    Audio_In_Ctx[Instance].SampleRate      = AudioInit->SampleRate;
    Audio_In_Ctx[Instance].BitsPerSample   = AudioInit->BitsPerSample;
    Audio_In_Ctx[Instance].Volume          = AudioInit->Volume;
    Audio_In_Ctx[Instance].State           = AUDIO_IN_STATE_INIT;

    /* Un-reset audio codec if not currently used by audio out instances */
    if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
    {
      /* Initialize the codec internal registers */
      if (WM8904_Probe() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      /* Set SAI instances (SAI1_Block_A needed for MCLK, FS and CLK signals) */
      haudio_in_sai.Instance  = AUDIO_IN_SAI;
      haudio_out_sai.Instance = AUDIO_OUT_SAI;

      /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        if (MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspInit(&haudio_in_sai);
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          SAI_MspInit(&haudio_out_sai);
        }
#else
        /* Register the default SAI MSP callbacks */
        if (Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
        {
          if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          if (Audio_Out_Ctx[0].IsMspCallbacksValid == 0U)
          {
            if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
        }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
      }

      if (ret == BSP_ERROR_NONE)
      {
        MX_SAI_Config_t mx_config;

        /* Prepare haudio_in_sai handle */
        mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
        mx_config.AudioMode             = SAI_MODESLAVE_RX;
        mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
        mx_config.MonoStereoMode        = (AudioInit->Device != AUDIO_IN_DEVICE_LINE_IN) ? SAI_MONOMODE :
                                          SAI_STEREOMODE;
        mx_config.DataSize              = SAI_DATASIZE_16;
        mx_config.FrameLength           = 32;
        mx_config.ActiveFrameLength     = 16;
        mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
        mx_config.Synchro               = SAI_SYNCHRONOUS;
        mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
        mx_config.SlotActive            = (AudioInit->Device != AUDIO_IN_DEVICE_LINE_IN) ? SAI_SLOTACTIVE_0 :
                                          (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1);

